#+TITLE: June 4-16, 2019 (13 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS                      | WAITING | DONE                                                          | CANCELED |
|------+------+----------------------------------+---------+---------------------------------------------------------------+----------|
|      |      | DEV.1555953324. Website Building |         | READ.1559575032. Read (2019-06-16)                            |          |
|      |      |                                  |         | READ.1553532278. Unix Concepts & Applications b (2019-06-16)  |          |
|      |      |                                  |         | READ.1559713451. Introduction to Computer Scien (2019-06-16)  |          |
|      |      |                                  |         | OPS.1559574312. Build GNU Emacs from source co (2019-06-15)   |          |
|      |      |                                  |         | READ.1559574998. Read (2019-06-15)                            |          |
|      |      |                                  |         | READ.1559588072. Elastic Cloud Infrastructure:  (2019-06-15)  |          |
|      |      |                                  |         | READ.1559588275. Elastic Cloud Infrastructure:  (2019-06-15)  |          |
|      |      |                                  |         | READ.1559581076. Write blog post on building Em (2019-06-14)  |          |
|      |      |                                  |         | WRITE.1557903518. Work at French, in the Fluent  (2019-06-14) |          |
|      |      |                                  |         | READ.1559574236. Read (2019-06-13)                            |          |
|      |      |                                  |         | READ.1559574679. Read (2019-06-13)                            |          |
|      |      |                                  |         | READ.1559630918. Read fiction (2019-06-13)                    |          |
|      |      |                                  |         | READ.1559587761. Essential Cloud Infrastructure (2019-06-11)  |          |
|      |      |                                  |         | READ.1559574102. Read (2019-06-10)                            |          |
|      |      |                                  |         | READ.1559574200. Read (2019-06-10)                            |          |
|      |      |                                  |         | WRITE.1559630427. Write once a week - 1 (2019-06-10)          |          |
|      |      |                                  |         | READ.1559492157. Essential Cloud Infrastructure (2019-06-06)  |          |
|      |      |                                  |         | READ.1559574004. Read (2019-06-04)                            |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME             |          ESTIMATED | ACTUAL |               DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|------------------+--------------------+--------+--------------------+-----------+--------------+------------|
| Sidntrivedi      |                  0 |      0 |                  0 |         0 |   2019-06-18 | ---------- |
| Sandeepk         | 20.490000000000002 |  23.32 | 20.490000000000002 |         0 |   2019-06-18 | ########## |
| Nightwarrior-Xxx |                 10 |   8.92 |                  0 |        10 |   2019-07-02 | ---------- |
| Jasonbraganza    |                 40 |  38.35 |                 40 |         0 |   2019-06-18 | ########## |
| Gandalfdwite     |                 13 |  13.15 |                 13 |         0 |   2019-06-18 | ########## |
| Bhavin192        |                  4 |   8.93 |                  4 |         0 |   2019-06-18 | ########## |
| Akshay196        |                 13 |   9.15 |                 13 |         0 |   2019-06-18 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph

#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:13]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED                                                |
|-----+------------+--------+-------+----------------------------------------------------------------|
|   1 | 2019-06-04 | 111.49 |   104 | READ.1559574004                                                |
|   2 | 2019-06-05 | 111.49 |    95 |                                                                |
|   3 | 2019-06-06 | 106.49 |    87 | READ.1559492157                                                |
|   4 | 2019-06-07 | 106.49 |    78 |                                                                |
|   5 | 2019-06-08 | 106.49 |    69 |                                                                |
|   6 | 2019-06-09 | 106.49 |    61 |                                                                |
|   7 | 2019-06-10 | 100.49 |    52 | WRITE.1559630427 READ.1559574200 READ.1559574102               |
|   8 | 2019-06-11 |  93.41 |    43 | READ.1559587761                                                |
|   9 | 2019-06-12 |  93.41 |    35 |                                                                |
|  10 | 2019-06-13 |  79.41 |    26 | READ.1559630918 READ.1559574679 READ.1559574236                |
|  11 | 2019-06-14 |  55.41 |    17 | WRITE.1557903518 READ.1559581076                               |
|  12 | 2019-06-15 |   44.0 |     9 | READ.1559588275 READ.1559588072 READ.1559574998 OPS.1559574312 |
|  13 | 2019-06-16 |   22.0 |     0 | READ.1559713451 READ.1553532278 READ.1559575032                |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                                   | TASKID           | OWNER            | PRIORITY | TODO        |          ESTIMATED | ACTUAL |
|------------------------------------------------------------------------+------------------+------------------+----------+-------------+--------------------+--------|
| TASKS                                                                  |                  |                  | B        |             | 112.49000000000001 | 101.82 |
|------------------------------------------------------------------------+------------------+------------------+----------+-------------+--------------------+--------|
| akshay196                                                              |                  |                  | B        |             |                 13 |   9.15 |
| Read [[https://debbugs.gnu.org/][GNU Bug Tracker]]                                                   | READ.1559574004  | akshay196        | B        | DONE        |                  1 |   0.82 |
| Read [[https://debbugs.gnu.org/Using.html][Using this system to track your project's bug]]                     | READ.1559574102  | akshay196        | B        | DONE        |                  2 |   0.95 |
| Read [[https://debbugs.gnu.org/server-control.html][Introduction to the bug control mailserver]]                        | READ.1559574200  | akshay196        | B        | DONE        |                  2 |   1.98 |
| Read [[https://debbugs.gnu.org/server-request.html][Introduction to the bug system request server]]                     | READ.1559574236  | akshay196        | B        | DONE        |                  2 |   0.65 |
| Read [[https://debbugs.gnu.org/Developer.html][Developers' information regarding the bug processing system]]       | READ.1559574679  | akshay196        | B        | DONE        |                  2 |   1.30 |
| Build GNU Emacs from source code                                       | OPS.1559574312   | akshay196        | B        | DONE        |                  2 |   1.78 |
| Read [[https://treyhunner.com/2016/04/how-to-loop-with-indexes-in-python/][How to loop with indexes in Python]]                                | READ.1559574998  | akshay196        | B        | DONE        |                  1 |   1.02 |
| Read [[https://treyhunner.com/2015/12/python-list-comprehensions-now-in-color/][Python List Comprehensions]]                                        | READ.1559575032  | akshay196        | B        | DONE        |                  1 |   0.65 |
|------------------------------------------------------------------------+------------------+------------------+----------+-------------+--------------------+--------|
| bhavin192                                                              |                  |                  | B        |             |                  4 |   8.93 |
| Write blog post on building Emacs from source                          | READ.1559581076  | bhavin192        | B        | DONE        |                  4 |   8.93 |
|------------------------------------------------------------------------+------------------+------------------+----------+-------------+--------------------+--------|
| gandalfdwite                                                           |                  |                  | B        |             |                 13 |  13.15 |
| Unix Concepts & Applications by Sumitabha Das - Part III               | READ.1553532278  | gandalfdwite     | B        | DONE        |                 13 |  13.15 |
|------------------------------------------------------------------------+------------------+------------------+----------+-------------+--------------------+--------|
| jasonbraganza                                                          |                  |                  | B        |             |                 40 |  38.35 |
| Work at French, in the Fluent forever app - Part III                   | WRITE.1557903518 | jasonbraganza    | B        | DONE        |                 20 |  12.42 |
| Write once a week - 1                                                  | WRITE.1559630427 | jasonbraganza    | B        | DONE        |                  2 |   1.15 |
| Read fiction                                                           | READ.1559630918  | jasonbraganza    | B        | DONE        |                 10 |  10.13 |
| Introduction to Computer Science and Programming Using Python - Part I | READ.1559713451  | jasonbraganza    | B        | DONE        |                  8 |  14.65 |
|------------------------------------------------------------------------+------------------+------------------+----------+-------------+--------------------+--------|
| nightwarrior-xxx                                                       |                  |                  | B        |             |                 10 |   8.92 |
| Website Building                                                       | DEV.1555953324   | nightwarrior-xxx | B        | IN_PROGRESS |                 10 |   8.92 |
|------------------------------------------------------------------------+------------------+------------------+----------+-------------+--------------------+--------|
| sandeepk                                                               |                  |                  | B        |             | 20.490000000000002 |  23.32 |
| Essential Cloud Infrastructure: Foundation                             | READ.1559492157  | sandeepk         | B        | DONE        |                  5 |   6.00 |
| Essential Cloud Infrastructure: Core Services                          | READ.1559587761  | sandeepk         | B        | DONE        |               7.08 |   7.85 |
| Elastic Cloud Infrastructure: Scaling and Automation                   | READ.1559588072  | sandeepk         | B        | DONE        |               6.41 |   7.05 |
| Elastic Cloud Infrastructure: Containers and Services                  | READ.1559588275  | sandeepk         | B        | DONE        |                  2 |   2.42 |
|------------------------------------------------------------------------+------------------+------------------+----------+-------------+--------------------+--------|
| sidntrivedi                                                            |                  |                  | B        |             |                 12 |        |
| Eloquent Javascript                                                    | READ.1559963113  | sidntrivedi      | B        |             |                 10 |        |
| Blog https://sidntrivedi.me                                            | WRITE.1539072660 | sidntrivedi      | B        |             |                  2 |        |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2019-06-04 Tue>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-gandalfdwite: 1
  :wpd-jasonbraganza: 4
  :wpd-nightwarrior-xxx: 1
  :wpd-sandeepk: 2
  :wpd-sidntrivedi: 1
  :END:
** akshay196
*** DONE Read [[https://debbugs.gnu.org/][GNU Bug Tracker]]
    CLOSED: [2019-06-04 Tue 21:23]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:   0.82
    :OWNER: akshay196
    :ID: READ.1559574004
    :TASKID: READ.1559574004
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-04 Tue 20:34]--[2019-06-04 Tue 21:23] =>  0:49
    :END:
*** DONE Read [[https://debbugs.gnu.org/Using.html][Using this system to track your project's bug]]
    CLOSED: [2019-06-10 Mon 07:19]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:   0.95
    :OWNER: akshay196
    :ID: READ.1559574102
    :TASKID: READ.1559574102
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-06 Thu 22:43]--[2019-06-06 Thu 23:14] =>  0:31
    CLOCK: [2019-06-05 Wed 20:07]--[2019-06-05 Wed 20:33] =>  0:26
    :END:
*** DONE Read [[https://debbugs.gnu.org/server-control.html][Introduction to the bug control mailserver]]
    CLOSED: [2019-06-10 Mon 20:56]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:   1.98
    :OWNER: akshay196
    :ID: READ.1559574200
    :TASKID: READ.1559574200
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-10 Mon 19:51]--[2019-06-10 Mon 20:56] =>  1:05
    CLOCK: [2019-06-10 Mon 07:19]--[2019-06-10 Mon 08:13] =>  0:54
    :END:
*** DONE Read [[https://debbugs.gnu.org/server-request.html][Introduction to the bug system request server]]
    CLOSED: [2019-06-13 Thu 00:01]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:   0.65
    :OWNER: akshay196
    :ID: READ.1559574236
    :TASKID: READ.1559574236
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-11 Tue 07:04]--[2019-06-11 Tue 07:43] =>  0:39
    :END:
*** DONE Read [[https://debbugs.gnu.org/Developer.html][Developers' information regarding the bug processing system]]
    CLOSED: [2019-06-13 Thu 01:20]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:   1.30
    :OWNER: akshay196
    :ID: READ.1559574679
    :TASKID: READ.1559574679
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-13 Thu 00:02]--[2019-06-13 Thu 01:20] =>  1:18
    :END:
*** DONE Build GNU Emacs from source code
    CLOSED: [2019-06-15 Sat 00:27]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:   1.78
    :OWNER: akshay196
    :ID: OPS.1559574312
    :TASKID: OPS.1559574312
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-14 Fri 23:32]--[2019-06-15 Sat 00:27] =>  0:55
    CLOCK: [2019-06-14 Fri 00:07]--[2019-06-14 Fri 00:59] =>  0:52
    :END:
*** DONE Read [[https://treyhunner.com/2016/04/how-to-loop-with-indexes-in-python/][How to loop with indexes in Python]]
    CLOSED: [2019-06-15 Sat 22:06]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:   1.02
    :OWNER: akshay196
    :ID: READ.1559574998
    :TASKID: READ.1559574998
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-15 Sat 21:05]--[2019-06-15 Sat 22:06] =>  1:01
    :END:
*** DONE Read [[https://treyhunner.com/2015/12/python-list-comprehensions-now-in-color/][Python List Comprehensions]]
    CLOSED: [2019-06-16 Sun 00:34]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:   0.65
    :OWNER: akshay196
    :ID: READ.1559575032
    :TASKID: READ.1559575032
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-15 Sat 23:55]--[2019-06-16 Sun 00:34] =>  0:39
    :END:
** bhavin192
*** DONE Write blog post on building Emacs from source
    CLOSED: [2019-06-14 Fri 18:08]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   8.93
    :OWNER: bhavin192
    :ID: READ.1559581076
    :TASKID: READ.1559581076
    :END:
** gandalfdwite
*** DONE Unix Concepts & Applications by Sumitabha Das - Part III [7/7]
    CLOSED: [2019-06-16 Sun 22:58]
   :PROPERTIES:
   :ESTIMATED: 13
   :ACTUAL:   13.15
   :OWNER: gandalfdwite
   :ID: READ.1553532278
   :TASKID: READ.1553532278
   :END:
   :LOGBOOK:
   CLOCK: [2019-06-16 Sun 11:35]--[2019-06-16 Sun 12:56] =>  1:21
   CLOCK: [2019-06-15 Sat 21:00]--[2019-06-15 Sat 22:10] =>  1:10
   CLOCK: [2019-06-14 Fri 20:05]--[2019-06-14 Fri 21:40] =>  1:35
   CLOCK: [2019-06-13 Thu 21:25]--[2019-06-13 Thu 22:05] =>  0:40
   CLOCK: [2019-06-11 Tue 22:41]--[2019-06-11 Tue 23:56] =>  1:15
   CLOCK: [2019-06-10 Mon 21:27]--[2019-06-10 Mon 22:25] =>  0:58
   CLOCK: [2019-06-09 Sun 18:56]--[2019-06-09 Sun 19:52] =>  0:56
   CLOCK: [2019-06-09 Sun 17:09]--[2019-06-09 Sun 18:03] =>  0:54
   CLOCK: [2019-06-08 Sat 19:40]--[2019-06-08 Sat 21:41] =>  2:01
   CLOCK: [2019-06-06 Thu 22:16]--[2019-06-06 Thu 23:25] =>  1:09
   CLOCK: [2019-06-05 Wed 22:30]--[2019-06-05 Wed 23:40] =>  1:10
   :END:
   - [X] 6. Basic file attributes                ( 1h)
   - [X] 7. Vi editor                            ( 3h)
   - [X] 8. The SHELL                            ( 2h)
   - [X] 9. The Process                          ( 1h)
   - [X] 10. Customizing environment             ( 1h)
   - [X] 11. More File attributes                ( 1h)
   - [X] 12. Simple filters                      ( 2h)
** jasonbraganza
*** DONE Work at French, in the Fluent forever app - Part III [11/11]
   CLOSED: [2019-06-14 Fri 09:35]
   :PROPERTIES:
   :ESTIMATED: 20
   :ACTUAL:   12.42
   :OWNER: jasonbraganza
   :ID: WRITE.1557903518
   :TASKID: WRITE.1557903518
   :END:
   :LOGBOOK:
   CLOCK: [2019-06-14 Fri 06:45]--[2019-06-14 Fri 09:35] =>  2:50
   CLOCK: [2019-06-13 Thu 07:35]--[2019-06-13 Thu 08:30] =>  0:55
   CLOCK: [2019-06-13 Wed 07:15]--[2019-06-13 Wed 08:30] =>  1:15
   CLOCK: [2019-06-13 Tue 06:15]--[2019-06-13 Tue 07:27] =>  1:12
   CLOCK: [2019-06-10 Mon 08:15]--[2019-06-10 Mon 09:52] =>  1:37
   CLOCK: [2019-06-07 Fri 07:12]--[2019-06-07 Mon 08:55] =>  1:43
   CLOCK: [2019-06-06 Thu 07:15]--[2019-06-06 Thu 08:04] =>  0:49
   CLOCK: [2019-06-05 Wed 08:06]--[2019-06-05 Wed 08:55] =>  0:49
   CLOCK: [2019-06-04 Tue 07:50]--[2019-06-04 Tue 09:05] =>  1:15
   :END:
   - [X] Completed 1 review session & 2 pronunciation lessons (1h)
   - [X] Completed 1 review session & 2 pronunciation lessons (1h)
   - [X] Completed 1 review session & 2 pronunciation lessons (1h)
   - [X] Completed 2 review sessions & 4 pronunciation lessons (1h)
   - [X] Completed 1 review session & 2 pronunciation lessons, wrote a post (1h)
   - [X] Completed 2 review sessions & 2 pronunciation lessons (1h)
   - [X] Completed 2 review sessions & 2 pronunciation lessons (1h)
   - [X] Completed 2 review sessions & 1 vocabulary lesson (1h)
   - [X] Completed 1 review sessions & 2 vocabulary lessons (1h)
   - [X] Completed 1 review sessions & created 4 vocabulary flashcards (1h)
   - [X] Completed 1 review sessions & 20 base vocabulary flashcards, wrote a post (1h)
*** DONE Write once a week - 1 [2/2]
   CLOSED: [2019-06-10 Mon 08:00]
   :PROPERTIES:
   :ESTIMATED: 2
   :ACTUAL:   1.15
   :OWNER: jasonbraganza
   :ID: WRITE.1559630427
   :TASKID: WRITE.1559630427
   :END:
   :LOGBOOK:
   CLOCK: [2019-06-10 Mon 07:30]--[2019-06-10 Mon 08:00] =>  0:30
   CLOCK: [2019-06-04 Tue 14:00]--[2019-06-04 Tue 14:39] =>  0:39
   :END:
   - [X] Write a short blog post. (1h)
   - [X] Write a short blog post. (1h)
*** DONE Read fiction [10/10]
   CLOSED: [2019-06-13 Thu 12:30]
   :PROPERTIES:
   :ESTIMATED: 10
   :ACTUAL:   10.13
   :OWNER: jasonbraganza
   :ID: READ.1559630918
   :TASKID: READ.1559630918
   :END:
   :LOGBOOK:
   CLOCK: [2019-06-13 Tue 08:30]--[2019-06-13 Thu 12:30] =>  4:00
   CLOCK: [2019-06-09 Sun 10:00]--[2019-06-09 Sun 12:00] =>  2:00
   CLOCK: [2019-06-06 Thu 11:00]--[2019-06-06 Thu 13:01] =>  2:01
   CLOCK: [2019-06-05 Wed 23:35]--[2019-06-06 Thu 00:45] =>  1:10
   CLOCK: [2019-06-05 Wed 09:09]--[2019-06-05 Wed 09:11] =>  0:02
   CLOCK: [2019-06-04 Tue 13:00]--[2019-06-04 Tue 13:55] =>  0:55
   :END:
   - [X] Read India Love Poems (1h)
   - [X] Read Love Poems & Love Letters (1h)
   - [X] Read Flower thoughts (1h)
   - [X] Read Thoughts for a Good Life (1h)
   - [X] Read Oscar Wilde Epigrams (1h)
   - [X] Read Balzac Epigrams (1h)
   - [X] Read Murder on the Links (1h)
   - [X] Read Murder on the Links (1h)
   - [X] Read Murder on the Links (1h)
   - [X] Read Murder on the Links (1h)
*** DONE Introduction to Computer Science and Programming Using Python - Part I [3/3]
   CLOSED: [2019-06-16 Sun 18:00]
   :PROPERTIES:
   :ESTIMATED: 8
   :ACTUAL:   14.65
   :OWNER: jasonbraganza
   :ID: READ.1559713451
   :TASKID: READ.1559713451
   :END:
   :LOGBOOK:
<<<<<<< HEAD
   CLOCK: [2019-06-16 Sun 14:00]--[2019-06-16 Sun 18:00] =>  4:00
   CLOCK: [2019-06-16 Sun 10:15]--[2019-06-16 Sun 13:00] =>  2:45
=======
>>>>>>> pravarag/operation-blue-moon-master
   CLOCK: [2019-06-15 Sat 16:34]--[2019-06-15 Sat 20:12] =>  3:38
   CLOCK: [2019-06-15 Sat 16:01]--[2019-06-15 Sat 16:34] =>  0:33
   CLOCK: [2019-06-15 Sat 15:45]--[2019-06-15 Sat 16:01] =>  0:16
   CLOCK: [2019-06-15 Sat 10:22]--[2019-06-15 Sat 10:44] =>  0:22
   CLOCK: [2019-06-15 Sat 10:08]--[2019-06-15 Sat 10:22] =>  0:14
   CLOCK: [2019-06-15 Sat 10:03]--[2019-06-15 Sat 10:08] =>  0:05
   CLOCK: [2019-06-15 Sat 09:40]--[2019-06-15 Sat 10:03] =>  0:23
   CLOCK: [2019-06-06 Thu 08:30]--[2019-06-06 Thu 10:00] =>  1:30
   CLOCK: [2019-06-05 Wed 22:37]--[2019-06-05 Wed 23:30] =>  0:53
   :END:
   - [X] 1. Introduction to Python (TIME: 1:03:12)
     - [X] Finger Exercises due Aug 8, 2019 05:00 IST  This content is graded
     - [X] Video: Introduction
     - [X] Video: Knowledge
     - [X] Exercises 1
     - [X] Exercises 2
     - [X] Video: Machines
     - [X] Exercises 3
     - [X] Video: Languages
     - [X] Exercises 4
     - [X] Video: Types
     - [X] Exercise 5
     - [X] Exercise 6
     - [X] Video: Variables
     - [X] Exercise 7
     - [X] Video: Operators and Branching
     - [X] Exercise 8
     - [X] Exercise 9
     - [X] Exercise 10
   - [X] 2. Core Elements of Programs (TIME: 54:14)
     - [X] Video: Bindings
     - [X] Video: Strings
     - [X] Exercise 1
     - [X] Exercise 2
     - [X] Video: Input/Output
     - [X] Exercise 3
     - [X] Video: IDEs
     - [X] Exercise: hello world
     - [X] Video: Control Flow
     - [X] Exercise: happy
     - [X] Exercise: vara varb
     - [X] Exercise 4
     - [X] Exercise: while
     - [X] Exercise: for
     - [X] Video: Iteration
     - [X] Exercise 5
     - [X] Exercise 6
     - [X] Video: Guess and Check
     - [X] Exercise 7
   - [X] Problem Set 1, due Jun 21, 2019 05:00 IST
     - [X] Problem 1
     - [X] Problem 2
     - [X] Problem 3
     - [X] Show your Appreciation!
** sandeepk
*** DONE Essential Cloud Infrastructure: Foundation [4/4]
    CLOSED: [2019-06-06 Thu 23:35]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:   6.00
    :OWNER: sandeepk
    :ID: READ.1559492157
    :TASKID: READ.1559492157
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-06 Thu 20:34]--[2019-06-06 Thu 23:35] =>  3:01
    CLOCK: [2019-06-06 Thu 00:05]--[2019-06-06 Thu 00:27] =>  0:22
    CLOCK: [2019-06-05 Wed 20:08]--[2019-06-05 Wed 21:00] =>  0:52
    CLOCK: [2019-06-04 Tue 21:30]--[2019-06-04 Tue 22:20] =>  0:50
    CLOCK: [2019-06-04 Tue 08:05]--[2019-06-04 Tue 09:00] =>  0:55
    :END:
    - [X] Welcome to cloud Infrastructure on Google Cloud Platform        (25m)
    - [X] Module - 1 Introduction to Google Cloud Platform Infrastructure (50m)
    - [X] Module - 2 Virtual Networking                                   (1h 40m)
    - [X] Module - 3 Virtual Machines                                     (2h 5m)
*** DONE Essential Cloud Infrastructure: Core Services [5/5]
    CLOSED: [2019-06-11 Tue 22:43]
    :PROPERTIES:
    :ESTIMATED: 7.08
    :ACTUAL:   7.85
    :OWNER: sandeepk
    :ID: READ.1559587761
    :TASKID: READ.1559587761
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-11 Tue 21:35]--[2019-06-11 Tue 22:43] =>  1:08
    CLOCK: [2019-06-11 Tue 21:06]--[2019-06-11 Tue 21:30] =>  0:24
    CLOCK: [2019-06-10 Mon 21:46]--[2019-06-10 Mon 23:06] =>  1:20
    CLOCK: [2019-06-10 Mon 20:53]--[2019-06-10 Mon 21:38] =>  0:45
    CLOCK: [2019-06-09 Sun 16:30]--[2019-06-09 Sun 17:30] =>  1:00
    CLOCK: [2019-06-09 Sun 14:33]--[2019-06-09 Sun 14:47] =>  0:14
    CLOCK: [2019-06-08 Sat 16:10]--[2019-06-08 Sat 16:20] =>  0:10
    CLOCK: [2019-06-07 Fri 20:30]--[2019-06-07 Fri 23:20] =>  2:50
    :END:
    - [X] Welcome to Essential Cloud Infrastructure: Core Services (5m)
    - [X] Module 1: Cloud IAM                                      (1h)
    - [X] Module 2: Data Storage Services                          (3h)
    - [X] Module 3: Resource Management                            (1h)
    - [X] Module 4: Resource Monitoring                            (2h)
*** DONE Elastic Cloud Infrastructure: Scaling and Automation [7/7]
    CLOSED: [2019-06-15 Sat 21:00]
    :PROPERTIES:
    :ESTIMATED: 6.41
    :ACTUAL:   7.05
    :OWNER: sandeepk
    :ID: READ.1559588072
    :TASKID: READ.1559588072
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-15 Sat 20:20]--[2019-06-15 Sat 21:00] =>  0:40
    CLOCK: [2019-06-14 Fri 20:34]--[2019-06-14 Fri 22:35] =>  2:01
    CLOCK: [2019-06-13 Thu 21:35]--[2019-06-13 Thu 22:58] =>  1:23
    CLOCK: [2019-06-13 Thu 21:15]--[2019-06-13 Thu 21:25] =>  0:10
    CLOCK: [2019-06-13 Thu 20:13]--[2019-06-13 Thu 20:26] =>  0:13
    CLOCK: [2019-06-12 Wed 20:40]--[2019-06-12 Wed 22:40] =>  2:00
    CLOCK: [2019-06-11 Tue 22:45]--[2019-06-11 Tue 23:21] =>  0:36
    :END:
    - [X] Welcome to Elastic Cloud Infrastructure: Scaling and Automation (5m)
    - [X] Module 1: Interconnecting Networks                              (2h)
    - [X] Module 2: Load Balancing                                        (2h)
    - [X] Module 3: Autoscaling                                           (1h)
    - [X] Module 4: Infrastructure Automation with Cloud API              (2h)
    - [X] Module 5: Infrastructure Automation with Deployment Manager     (1h)
    - [X] Module 6: Managed Services                                      (20m)
*** DONE Elastic Cloud Infrastructure: Containers and Services [4/4]
    CLOSED: [2019-06-15 Sat 23:40]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:   2.42
    :OWNER: sandeepk
    :ID: READ.1559588275
    :TASKID: READ.1559588275
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-15 Sat 22:50]--[2019-06-15 Sat 23:40] =>  0:50
    CLOCK: [2019-06-15 Sat 21:05]--[2019-06-15 Sat 22:40] =>  1:35
    :END:
    - [X] Welcome to Elastic Infrastructure: Containers and Services (5m)
    - [X] Module 1: Application Infrastructure Services              (30m)
    - [X] Module 2: Application Development Services                 (20m)
    - [X] Module 3: Containers                                       (1h)
** sidntrivedi
*** Eloquent Javascript
    :PROPERTIES:
      :ESTIMATED: 10
      :ACTUAL:
      :OWNER: sidntrivedi
      :ID: READ.1559963113
      :TASKID: READ.1559963113
      :END:
      - [ ] Values, Types, and Operators
      - [ ] Program Structure
      - [ ] Functions
      - [ ] Data Structures: Objects and Arrays
      - [ ] Higher-order Functions
      - [ ] The Secret Life of Objects
      - [ ] Project: A Robot
*** Blog https://sidntrivedi.me
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: sidntrivedi
    :ID: WRITE.1539072660
    :TASKID: WRITE.1539072660
    :END:
    - [ ] Write one blog every week.
